In [1]:
import pandas as pd

hello = {
    'Name' : ["gulam", "hisham", "adil"],
    "age" : [20,25,30],
    'place':['kozhikode', 'kochi', 'arecode']
}

df = pd.DataFrame(hello)
df

     Name  age      place
0   gulam   20  kozhikode
1  hisham   25      kochi
2    adil   30    arecode

In [2]:
df.iloc[1:,1:]

   age    place
1   25    kochi
2   30  arecode

In [4]:
def mult(A,B):
    n = len(A)
    m = len(B[0])
    p = len(A[0])
    c = [[0 for i in range(m)] for j in range(n)]
    
    for i in range(n):
        for j in range(m):
            for k in range(p):
                c[i][j] += A[i][k] * B[k][j]
                
    return c

A = [[1,2,3], [4,5,6], [7,8,9]]
B = [[9,8,7], [6,5,4], [3,2,1]]

S = mult(A,B)
print(S)

[[30, 24, 18], [84, 69, 54], [138, 114, 90]]